---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewportPositioning
source: html/0ae859ee-09d1-c690-93e5-5f17e0bbc328.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewportPositioning Property

"Viewport Positioning"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewportPositioning { get; }
```